Repository: 84000/data-translation-memory
Catalog: toh100-v1.tmx
Source language: bo
Languages: en

source: མིང་མེད་པ་ནི་དབྱེར་མེད་པའོ། །
en: No-notion is non-division.

source: དེ་བཞིན་ཉིད་ནི་གཞིའོ། །
en: The tathatā is the basis.

source: གནས་མེད་པ་ནི་དབྱེར་མེད་པའོ། །
en: No-ground-to-stand-upon is non-division.

source: ཆོས་ཀྱི་དབྱིངས་ནི་གཞིའོ། །
en: The dharmadhātu is the basis.

source: ཐ་དད་པ་ཉིད་མེད་པ་ནི་དབྱེར་མེད་པའོ། །
en: Non-multiplicity is non-division.

source: ཡང་དག་པའི་མཐའ་ནི་གཞིའོ། །
en: The true limit is the basis.

source: དམིགས་པ་མེད་པ་ནི་དབྱེར་མེད་པའོ། །
en: Non-apprehension is non-division.

source: གཡོ་བ་མེད་པ་ནི་གཞིའོ། །
en: Non-movement is the basis.

source: སྟོང་པ་ཉིད་ནི་དབྱེར་མེད་པའོ། །
en: Emptiness is non-division.

source: མཚན་མ་མེད་པ་ནི་གཞིའོ། །
en: No-sign is the basis.

source: རྣམ་པར་རྟོག་པ་མེད་པ་ནི་དབྱེར་མེད་པའོ། །
en: Non-deliberation is non-division.

source: སྨོན་པ་མེད་པ་ནི་གཞིའོ།
en: No-wish is the basis.

source: སེམས་ཅན་མེད་པ་ནི་གཞིའོ། །
en: Being without a sentient being is the basis.

source: སེམས་ཅན་གྱི་ངོ་བོ་ཉིད་མེད་པ་ནི་དབྱེར་མེད་པའོ། །
en: Non-essence of a sentient being is non-division.

source: ནམ་མཁའ་ནི་གཞིའོ། །
en: Space is the basis.

source: དམིགས་སུ་མེད་པ་ནི་དབྱེར་མེད་པའོ། །
en: Non-perception is non-division.

source: སྐྱེ་བ་མེད་པ་ནི་གཞིའོ། །
en: Non-arising is the basis.

source: འགག་པ་མེད་པ་ནི་དབྱེར་མེད་པའོ། །
en: Non-cessation is non-division.

source: འདུས་མ་བྱས་ནི་གཞིའོ། །
en: The unproduced is the basis.

source: སྤྱོད་པ་མེད་པ་ནི་དབྱེར་མེད་པའོ། །
en: No moving about is non-division.

source: བྱང་ཆུབ་ནི་གཞིའོ། །
en: Awakening is the basis.

source: ཉེ་བར་ཞི་བ་ནི་དབྱེར་མེད་པའོ། །
en: Pacification is non-division.

source: མྱ་ངན་ལས་འདས་པ་ནི་གཞིའོ། །
en: Nirvāṇa is the basis.

source: མངོན་པར་འགྲུབ་པ་མེད་པ་ནི་དབྱེར་མེད་པའོ། །
en: Non-development is non-division;

source: འཇམ་དཔལ་བྱང་ཆུབ་ནི་ལུས་ཀྱིས་མངོན་པར་རྫོགས་པར་བྱང་ཆུབ་པར་མི་འགྱུར་ཏེ།
en: “Awakening, Mañjuśrī, is not realized by the body

source: སེམས་ཀྱིས་ཀྱང་མ་ཡིན་ནོ།
en: nor by the mind.

source: འཇམ་དཔལ་ལུས་ནི་བེམས་པོ་གཡོ་བ་མེད་པ་སེམས་པ་མེད་པ་སྟེ།
en: The body, Mañjuśrī, is inert, motionless, and insentient.

source: རྩྭ་དང་། རྩིག་པ་དང་། ཤིང་དང་བོང་བ་དང་། གཟུགས་བརྙན་ལྟ་བུ་ཡིན་ལ།
en: It is similar and comparable to grass, logs of wood, walls, or clay.

source: སེམས་ཀྱང་སྒྱུ་མ་ལྟ་བུ་སྟེ།
en: “The mind, on the other hand, can be compared to an illusion.

source: གསོག་དང་གསོབ་དང་། ཡང་དག་པ་མ་ཡིན་པ་དང་། འདུས་མ་བྱས་པ་ཡིན་པའི་ཕྱིར་རོ། །
en: It is hollow, void, unreal, and unproduced.

source: འཇམ་དཔལ་གང་གིས་ལུས་དང་སེམས་དེ་ལྟར་རྟོགས་པ་དེ་ནི་བྱང་ཆུབ་ཅེས་བྱ་སྟེ།
en: Mañjuśrī, to realize the body and mind in this manner is explained as awakening.

source: འཇམ་དཔལ་དེ་ཡང་ཐ་སྙད་ལ་བརྟེན་པ་ཡིན་གྱི་དོན་དམ་པར་ནི་མ་ཡིན་ནོ།
en: This is based on conventional usage, but it is not in the ultimate sense.

source: འཇམ་དཔལ་བྱང་ཆུབ་ནི་ལུས་དང་སེམས་དང་ཆོས་དང་ཆོས་མ་ཡིན་པ་དང་། ཡང་དག་པ་དང་ཡང་དག་པ་མ་ཡིན་པ་དང་། བདེན་པ་དང་བརྫུན་པས་བརྗོད་པར་བྱ་བ་མ་ཡིན་པའི་ཕྱིར་རོ། །
en: Mañjuśrī, awakening cannot be explained in terms of the body, the mind, or dharma, non-dharma, real, unreal, truth, or falsity.

source: འཇམ་དཔལ་བྱང་ཆུབ་ནི་ཆོས་ཐམས་ཅད་ཀྱིས་བརྗོད་པར་བྱ་བ་མ་ཡིན་པ་སྟེ།
en: “Awakening, Mañjuśrī, cannot be expressed through any dharma.

source: འཇམ་དཔལ་བྱང་ཆུབ་ལ་ནི་གང་གིས་ཚིག་དང་ཐ་སྙད་འཇུག་པར་འགྱུར་བའི་གནས་ཅུང་ཟད་ཀྱང་མེད་པའི་ཕྱིར་རོ། །
en: Mañjuśrī, awakening does not have the slightest location that allows it to enter conventional usage.

source: ནམ་མཁའ་ནི་གནས་མེད་པ།
en: space has no location;

source: འདུས་མ་བྱས་པ།
en: it is unproduced,

source: བརྗོད་པར་བྱ་བ་མ་ཡིན་པའོ། །
en: cannot be expressed.

source: འཇམ་དཔལ་དེ་བཞིན་དུ་བྱང་ཆུབ་ཀྱང་གནས་མེད་པ།
en: In the same way, Mañjuśrī, awakening has no location;

source: འཇམ་དཔལ་འདི་ལྟ་སྟེ་དཔེར་ན། ཡང་དག་པར་ཡོངས་སུ་ཚོལ་བ་ན་ཆོས་ཐམས་ཅད་ཀྱིས་བརྗོད་པར་བྱ་བ་མ་ཡིན་པ་དེ་བཞིན་དུ།
en: Mañjuśrī, when searching for the real space, it cannot be explained through any dharma.

source: འཇམ་དཔལ་ཡང་དག་པར་བྱང་ཆུབ་ཡོངས་སུ་ཚོལ་བ་ན་ཡང་ཆོས་ཐམས་ཅད་ཀྱིས་བརྗོད་པར་བྱ་བ་མ་ཡིན་ནོ།
en: Mañjuśrī, when searching for the real awakening, it cannot be explained through any dharma.

source: འཇམ་དཔལ་ཡང་དག་པར་ནི་ཚིག་ནི་མ་སྐྱེས་པ་དང་། མ་འགགས་པ་ཡིན་པས་ཡོད་པ་མ་ཡིན་པའི་ཕྱིར་རོ། །
en: Mañjuśrī, with respect to what is real, no words can be found, because it is non-arisen and unceasing.

source: འཇམ་དཔལ་བྱང་ཆུབ་ནི་གཟུང་བ་མེད་པ་ཉིད་དང་། གནས་མེད་པ་ཉིད་ཡིན་ཏེ།
en: “Awakening, Mañjuśrī, means to be ungraspable and to have no abode.

source: འཇམ་དཔལ་དེ་ལ་གཟུང་བ་མེད་པ་ནི་གང་།
en: In that respect, Mañjuśrī, what is it to be ungraspable,

source: གནས་མེད་པ་ནི་གང་ཞེ་ན།
en: what is it to have no abode?

source: འཇམ་དཔལ་མིག་ཡོངས་སུ་ཤེས་པ་ནི་གཟུང་བ་མེད་པ་ཉིད་ཡིན་ནོ
en: The thorough cognition of the eye, Mañjuśrī, is to be ungraspable.

source: གཟུགས་དམིགས་སུ་མེད་པ་ནི་གནས་མེད་པ་ཉིད་ཡིན་ནོ། །
en: The non-perception of form is to have no abode.

source: རྣ་བ་ཡོངས་སུ་ཤེས་པ་ནི་གཟུང་བ་མེད་པ་ཉིད་ཡིན་ནོ། །
en: The thorough cognition of the ear is to be ungraspable.

source: སྒྲ་དམིགས་སུ་མེད་པ་ནི་གནས་མེད་པ་ཉིད་ཡིན་ནོ། །
en: The non-perception of sound is to have no abode.

source: སྣ་ཡོངས་སུ་ཤེས་པ་ནི་གཟུང་བ་མེད་པ་ཉིད་ཡིན་ནོ། །
en: The thorough cognition of the nose is to be ungraspable.

source: དྲི་དམིགས་སུ་མེད་པ་ནི་གནས་མེད་པ་ཉིད་ཡིན་ནོ། །
en: The non-perception of smell is to have no abode.

source: ལྕེ་ཡོངས་སུ་ཤེས་པ་ནི་གཟུང་བ་མེད་པ་ཉིད་ཡིན་ནོ། །
en: The thorough cognition of the tongue is to be ungraspable.

source: རོ་དམིགས་སུ་མེད་པ་ནི་གནས་མེད་པ་ཉིད་ཡིན་ནོ། །
en: The non-perception of flavor is to have no abode.

source: ལུས་ཡོངས་སུ་ཤེས་པ་ནི་གཟུང་བ་མེད་པ་ཉིད་ཡིན་ནོ། །
en: The thorough cognition of the body is to be ungraspable.

source: རེག་བྱ་དམིགས་སུ་མེད་པ་ནི་གནས་མེད་པ་ཉིད་ཡིན་ནོ། །
en: The non-perception of touchable things is to have no abode.

source: ཡིད་ཡོངས་སུ་ཤེས་པ་ནི་གཟུང་བ་མེད་པ་ཉིད་ཡིན་ནོ། །
en: The thorough cognition of the mind is to be ungraspable.

source: ཆོས་དམིགས་སུ་མེད་པ་ནི་གནས་མེད་པ་ཉིད་ཡིན་ནོ། །
en: The non-perception of dharmas is to have no abode.

source: དེ་བཞིན་གཤེགས་པས་ནི་དེ་ལྟར་གཟུང་བ་མེད་པ་ཉིད་དང་། གནས་མེད་པ་ཉིད་དུ་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་ཏེ།
en: In this way, the Tathāgata has realized awakening, ungraspable and without abode.

source: མིག་གཟུང་དུ་མེད་པ་དང་། གཟུགས་དམིགས་སུ་མེད་པའི་ཕྱིར།
en: by not grasping at the eye and not perceiving form,

source: མིག་གི་རྣམ་པར་ཤེས་པ་ལ་མི་གནས་སོ། །
en: the eye-consciousness has no ground to stand upon.

source: རྣ་བ་གཟུང་དུ་མེད་པ་དང་།
en: Not grasping at the ear and

source: སྒྲ་དམིགས་སུ་མེད་པའི་ཕྱིར་རྣ་བའི་རྣམ་པར་ཤེས་པ་ལ་མི་གནས་སོ། །
en: not perceiving sounds, the ear-consciousness has no ground to stand upon.

source: སྣ་གཟུང་དུ་མེད་པ་དང་།
en: Not grasping at the nose and

source: དྲི་དམིགས་སུ་མེད་པའི་ཕྱིར་སྣའི་རྣམ་པར་ཤེས་པ་ལ་མི་གནས་སོ། །
en: not perceiving smells, the nose-consciousness has no ground to stand upon.

source: ལུས་གཟུང་དུ་མེད་པ་དང་།
en: Not grasping at the body and

source: རེག་བྱ་དམིགས་སུ་མེད་པའི་ཕྱིར་ལུས་ཀྱི་རྣམ་པར་ཤེས་པ་ལ་མི་གནས་སོ། །
en: not perceiving touchable things, the body-consciousness has no ground to stand upon.

source: ཡིད་གཟུང་དུ་མེད་པ་དང་།
en: Not grasping at the mind and

source: ཆོས་དམིགས་སུ་མེད་པའི་ཕྱིར་ཡིད་ཀྱི་རྣམ་པར་ཤེས་པ་ལ་མི་གནས་ཏེ།
en: not perceiving dharmas, the mind-consciousness has no ground to stand upon.

source: དེའི་ཕྱིར་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ནི་རྣམ་པར་ཤེས་པ་ལ་མི་གནས་པ་དང་ལྡན་པ་ཞེས་བྱ་བའི་གྲངས་སུ་འགྲོའོ། །
en: Therefore, as his consciousness has no ground to stand upon, he comes to be counted as the tathāgata, the arhat, the perfect and complete Buddha.

source: འཇམ་དཔལ་བཞི་པོ་འདི་དག་ནི་སེམས་ཅན་རྣམས་ཀྱི་སེམས་ཀྱི་གནས་ཡིན་ཏེ།
en: “Mañjuśrī, there are four grounds for the minds of sentient beings to stand upon.

source: བཞི་གང་ཞེ་ན།
en: Which four?

source: གཟུགས་ནི་སེམས་ཅན་རྣམས་ཀྱི་སེམས་ཀྱི་གནས་ཡིན་ནོ།
en: Form is a ground for the mind of sentient beings to stand upon.

source: འདི་ལྟ་སྟེ། །
en: Similarly,

source: འཇམ་དཔལ་དེ་བཞིན་དུ་ཚོར་བ་དང་། འདུ་ཤེས་དང་། འདུ་བྱེད་རྣམས་ནི་སེམས་ཅན་རྣམས་ཀྱི་སེམས་ཀྱི་གནས་ཡིན་ཏེ།
en: Mañjuśrī, feeling, notion, and co-producing factors are grounds for the minds of sentient beings to stand upon.

source: འཇམ་དཔལ་དེ་བཞིན་གཤེགས་པས་ནི་སེམས་ཅན་རྣམས་ཀྱི་སེམས་ཀྱི་གནས་བཞི་པོ་དེ་དག་མ་སྐྱེས་པ་དང་། མ་འགགས་པར་ཤེས་སོ།
en: Mañjuśrī, these four grounds for the mind to stand upon are known by the Tathāgata to be non-arisen and unceasing.

source: འཇམ་དཔལ་བྱང་ཆུབ་ཅེས་བྱ་བ་དེ་ནི་སྟོང་པ་ཉིད་ཀྱི་ཚིག་བླ་དགས་ཡིན་ཏེ།
en: “Awakening, Mañjuśrī, is an appellation for emptiness.

source: འཇམ་དཔལ་སྟོང་པ་ཉིད་གང་གིས་བྱང་ཆུབ་སྟོང་པའི་སྟོང་པ་ཉིད་དེས་ཆོས་ཐམས་ཅད་ཀྱང་སྟོང་སྟེ།
en: Mañjuśrī, the emptiness by which awakening is empty is also the emptiness by which all dharmas are empty.

source: དེ་བཞིན་གཤེགས་པས་ནི་དེ་དག་ཇི་ལྟར་སྟོང་པ་དེ་ལྟ་བུ་ཁོ་ནར་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་སོ། །
en: And the Tathāgata realized them, precisely in the way in which they are empty.

source: འཇམ་དཔལ་སྟོང་པ་ཉིད་ཀྱིས་སྟོང་པ་ཉིད་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་པ་ཡང་མ་ཡིན་ཏེ།
en: Mañjuśrī, it is not that emptiness is realized through emptiness.

source: འཇམ་དཔལ་འདི་ལྟ་སྟེ།
en: On the other hand, Mañjuśrī,

source: སྟོང་པ་ཉིད་དམ་བྱང་ཆུབ་དེ་ནི་ཤེས་པའི་ཚུལ་གཅིག་པ་ཡིན་ནོ། །
en: there is one single method: emptiness, or awakening.

source: འཇམ་དཔལ་གང་ལ་སྟོང་པ་ཉིད་ཀྱང་མེད། བྱང་ཆུབ་ཀྱང་མེད་པ་
en: Mañjuśrī, where there is no emptiness, there is no awakening.

source: དེ་ལ་ནི་འཇམ་དཔལ་གང་གིས་སྟོང་པ་ཉིད་དང་། བྱང་ཆུབ་ཅེས་གཉིས་སུ་དབྱེ་བའི་གཉིས་ནི་ཅུང་ཟད་ཀྱང་མེད་དོ།
en: In that respect, Mañjuśrī, there is no duality by which emptiness and awakening could be made into two.

source: འཇམ་དཔལ་ཆོས་ཐམས་ཅད་ནི་གཉིས་སུ་མེད་པ།
en: Mañjuśrī, all dharmas are non-dual,

source: མཚན་ཉིད་མེད་པ་གཉིས་སུ་དབྱེར་མེད་པ།
en: without characteristics, not made into two,

source: མིང་མེད་པ་
en: without names,

source: རྒྱུ་བ་མེད་པ།
en: not acting,

source: སྤྱོད་པ་མེད་པ།
en: not moving forth,

source: ཀུན་འབྱུང་བ་མེད་པ།
en: not occurring,

source: སྒྲ་མེད་པ་ཡིན་པའི་ཕྱིར་རོ།།
en: without speech.

source: འཇམ་དཔལ་སྟོང་པ་ཉིད་ཅེས་བྱ་བ་གང་ཡིན་པ་དེ་ནི་མངོན་པར་ཞེན་པ་མེད་པ་དང་། འཛིན་པ་མེད་པའི་ཚིག་བླ་དགས་ཡིན་ཏེ།
en: Mañjuśrī, that which is called empty is an appellation for no attachment and no grasping.

source: འཇམ་དཔལ་དེ་ལ་ནི་དོན་དམ་པར་ན་གང་སྟོང་པ་ཞེས་བྱ་བའི་ཆོས་གང་ཡང་དམིགས་སུ་མེད་དོ།
en: On the other hand, Mañjuśrī, in the ultimate sense, no dharma called empty is there to be perceived.

source: ནམ་མཁའ་ནམ་མཁའ་ཞེས་བརྗོད་ཀྱང་ནམ་མཁའ་ནི་བརྗོད་པར་བྱ་བ་མ་ཡིན་ནོ། །
en: the sky is called sky, yet the sky cannot be expressed.

source: འཇམ་དཔལ་དེ་བཞིན་དུ་སྟོང་པ་སྟོང་པ་ཞེས་བརྗོད་ཀྱང་སྟོང་པ་ནི་བརྗོད་པར་བྱ་བ་མ་ཡིན་ཏེ།
en: In the same way, Mañjuśrī, we say ‘empty, empty’ as an entrance to inexpressible, empty things.

source: ཆོས་ཐམས་ཅད་ནི་མིང་མེད་པ་ཡིན་ན
en: “All dharmas are nameless,

source: དེ་དག་ལ་མིང་གིས་རྗོད་པར་བྱེད་དེ།
en: yet all dharmas are described through names.

source: འཇམ་དཔལ་ཇི་ལྟར་མིང་ཡུལ་ན་གནས་པ་མ་ཡིན།
en: Mañjuśrī, a name is not placed in either a primary or an intermediate location.

source: འཇམ་དཔལ་དེ་བཞིན་གཤེགས་པས་ནི་ཆོས་དེ་དག་ཐམས་ཅད་དེ་ལྟར་གཟོད་མ་ཉིད་ནས་མ་སྐྱེས་པ་མ་བྱུང་བ།
en: “Thus, Mañjuśrī, all the dharmas are known by the Tathāgata to be, from the very beginning, unborn, non-arisen,

source: མཚན་ཉིད་མེད་པ། །
en: without characteristics,

source: སྒྲ་མེད་པར་ཤེས་སོ།
en: without voice,

source: དེ་ཁོ་ན་བཞིན་དུ་རྣམ་པར་གྲོལ་ཏེ།
en: They are known to be just free.

source: བཅིངས་པ་ལས་གྲོལ་བར་གྱུར་པ་མ་ཡིན་ནོ། །
en: it is not that they are first bound and then freed.

source: འཇམ་དཔལ་བྱང་ཆུབ་ནི་ནམ་མཁའ་དང་མཉམ་པ་སྟེ།
en: “Awakening, Mañjuśrī, is the same as the sky.

source: ནམ་མཁའ་ནི་མཉམ་པ་མ་ཡིན། མི་མཉམ་པ་མ་ཡིན་
en: The sky is neither even nor uneven.

source: ལ་བྱང་ཆུབ་ཀྱང་མཉམ་པ་མ་ཡིན། མི་མཉམ་པ་མ་ཡིན་ནོ། །
en: Awakening, too, is neither even nor uneven.

source: འཇམ་དཔལ་ཆོས་གང་ལ་ཡང་དག་པར་ཡོངས་སུ་འགྲུབ་པ་མེད་པ་དེ་ནི་མཉམ་པ་དང་། མི་མཉམ་པར་བརྗོད་པར་བྱ་བ་མ་ཡིན་པའི་ཕྱིར་རོ། །
en: Mañjuśrī, a dharma with no real perfection cannot be spoken of as either even or uneven.

source: འཇམ་དཔལ་དེ་བཞིན་གཤེགས་པས་ནི་དེ་ལྟར་ཆོས་ཐམས་ཅད་མཉམ་པ་མེད་པ་དང་། མི་མཉམ་པ་མེད་པར་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་ཏེ།
en: Therefore, Mañjuśrī, all dharmas are realized by the Tathāgata as neither even nor uneven.

source: ཇི་ལྟར་ཆོས་ཕྲ་རབ་ཙམ་ཡང་མཉམ་པར་མ་བྱས། མི་མཉམ་པར་མ་བྱས་པ་དེ་ལྟར་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་ཤིང་།
en: They are realized in such a way that not even an atom is made even or uneven.

source: ཡང་དག་པའི་ཤེས་པས་ཆོས་དེ་དག་ཇི་ལྟ་བ་དེ་ལྟ་བུ་ཁོ་ནར་ཤེས་སོ། །
en: Dharmas are cognized just as they are.

source: འཇམ་དཔལ་ཡང་དག་པའི་ཤེས་པ་ཡང་གང་ཞེ་ན།
en: “And how does that accord with the awareness of reality?

source: འཇམ་དཔལ་ཆོས་ཐམས་ཅད་རྩ་བ་མེད་པ་དང་། མ་སྐྱེས་པ་དང་། མ་འགགས་པ་དང་། མ་བྱུང་བ་ལས་འབྱུང་བ་དང་། བྱུང་ནས་ཀྱང་འཇིག་པར་འགྱུར་ཏེ། །
en: Mañjuśrī, all dharmas, non-arisen and unceasing, come into being after having not existed.

source: འཇམ་དཔལ་དེ་ལྟར་བྱུང་བ་དང་། འཇིག་པ་ལ་བརྟེན་ནས་ཆོས་རྣམས་འཇུག་པར་འགྱུར་ཡང་འདི་ལ་འཇུག་པར་འགྱུར་བ་གང་ཡང་མེད་དེ།
en: In this way, Mañjuśrī, they come into existence and go out of existence.

source: དེ་ནི་ལམ་གྱི་རྒྱུན་བཅད་པའི་ཕྱིར་དེ་བཞིན་གཤེགས་པ་ཆོས་སྟོན་པ་ཞེས་བྱའོ། །
en: Thus it is said that the Tathāgata teaches the Dharma for the sake of cutting off the dharmas.

source: འཇམ་དཔལ་བྱང་ཆུབ་ཅེས་བྱ་བ་དེ་ནི་ཇི་ལྟ་བ་བཞིན་གྱི་གནས་ཡིན་ཏེ། །
en: “Awakening, Mañjuśrī, is a consistent basis.

source: འཇམ་དཔལ་དེ་ལ་ཇི་ལྟ་བ་བཞིན་གྱི་གནས་གང་ཞེ་ན།
en: In that respect, Mañjuśrī, what is a consistent basis?

source: འཇམ་དཔལ་ཇི་ལྟ་བ་བཞིན་གྱི་གནས་ཞེས་བྱ་བ་ནི་བྱང་ཆུབ་སྟེ། བྱང་ཆུབ་ཇི་ལྟ་བ་དེ་བཞིན་དུ་གཟུགས་ཀྱང་དེ་བཞིན་ཉིད་ལས་མི་འདའོ། །
en: Mañjuśrī, just like awakening, so also form does not swerve from the tathatā.

source: བྱང་ཆུབ་ཇི་ལྟ་བ་དེ་བཞིན་དུ་ཚོར་བ་དང་། འདུ་ཤེས་དང་། འདུ་བྱེད་རྣམས་དང་། རྣམ་པར་ཤེས་པ་ཡང་དེ་བཞིན་ཉིད་ལས་མི་འདའོ།
en: Just like awakening, so also feeling, notion, co-producing factors, and consciousness do not swerve from the tathatā.

source: བྱང་ཆུབ་ཇི་ལྟ་བ་དེ་བཞིན་དུ་ཚོར་བ་དང་། འདུ་ཤེས་དང་། འདུ་བྱེད་རྣམས་དང་། རྣམ་པར་ཤེས་པ་ཡང་དེ་བཞིན་ཉིད་ལས་མི་འདའོ། །
en: Just like awakening, so also feeling, notion, co-producing factors, and consciousness do not swerve from the tathatā.

source: བྱང་ཆུབ་ཇི་ལྟ་བ་དེ་བཞིན་དུ་སའི་ཁམས་ཀྱང་དེ་བཞིན་ཉིད་ལས་མི་འདའོ། །
en: Just like awakening, so also the earth element does not swerve from the tathatā.

source: བྱང་ཆུབ་ཇི་ལྟ་བ་དེ་བཞིན་དུ་ཆུའི་ཁམས་དང་།
en: Just like awakening, so also the water element,

source: མེའི་ཁམས་དང་།
en: the heat element,

source: རླུང་གི་ཁམས་ཀྱང་དེ་བཞིན་ཉིད་ལས་མི་འདའོ།
en: the wind element do not swerve from the tathatā.

source: འཇམ་དཔལ་བྱང་ཆུབ་ཇི་ལྟ་བ་དེ་བཞིན་དུ་མིག་གི་ཁམས་དང་།
en: “Just like awakening, so also the eye-base,

source: གཟུགས་ཀྱི་ཁམས་དང་། །
en: the form-base, and

source: མིག་གི་རྣམ་པར་ཤེས་པའི་ཁམས་ཀྱང་དེ་བཞིན་ཉིད་ལས་མི་འདའོ། །
en: the eye-consciousness-base do not swerve from the tathatā.

source: བྱང་ཆུབ་ཇི་ལྟ་བ་དེ་བཞིན་དུ་རྣ་བའི་ཁམས་དང་།
en: Just like awakening, Mañjuśrī, the ear-base,

source: སྒྲའི་ཁམས་དང་།
en: the sound-base,

source: རྣ་བའི་རྣམ་པར་ཤེས་པའི་ཁམས་དང་།
en: the ear-consciousness-base,

source: སྣའི་ཁམས་དང་།
en: the nose-base,

source: དྲིའི་ཁམས་དང་།
en: the smell-base,

source: སྣའི་རྣམ་པར་ཤེས་པའི་ཁམས་དང་།
en: the nose-consciousness-base,

source: ལྕེའི་ཁམས་དང་།
en: the tongue-base,

source: རོའི་ཁམས་དང་།
en: the flavor-base,

source: ལྕེའི་རྣམ་པར་ཤེས་པའི་ཁམས་དང་།
en: the tongue-consciousness-base,

source: ལུས་ཀྱི་ཁམས་དང་།
en: the body-base,

source: རེག་བྱའི་ཁམས་དང་།
en: the touchable-base,

source: ལུས་ཀྱི་རྣམ་པར་ཤེས་པའི་ཁམས་དང་།
en: the body-consciousness-base,

source: ཡིད་ཀྱི་ཁམས་དང་།
en: the mind-base,

source: ཆོས་ཀྱི་ཁམས་དང་།
en: the dharma-base,

source: ཡིད་ཀྱི་རྣམ་པར་ཤེས་པའི་ཁམས་ཀྱང་དེ་བཞིན་ཉིད་ལས་མི་འདའོ། །
en: the mind-consciousness-base do not swerve from the tathatā.

source: ཆོས་གདགས་པ་དེ་ནི་འདི་ཙམ་དུ་ཟད་དེ།
en: “And dharmas can be designated

source: འདི་ལྟ་སྟེ་ཕུང་པོ་དང་།
en: just as this: the aggregates,

source: ཁམས་དང་།
en: the bases, and

source: སྐྱེ་མཆེད་དུ་གདགས་པའོ། །
en: the entrances.

source: དེ་བཞིན་གཤེགས་པས་ནི་དེ་དག་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་དུ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་ཤིང་ཕྱིན་ཅི་མ་ལོག་པར་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་སོ། །
en: And this entire set has been realized by the Tathāgata as consistent:

source: དེ་དག་ནི་སྔོན་ཇི་ལྟ་བ་བཞིན་དུ་ཕྱིས་ཀྱང་དེ་བཞིན་བར་དུ་ཡང་དེ་བཞིན་ཏེ།
en: as it is before, so also is it later, and in between.

source: སྔོན་གྱི་མཐར་མ་སྐྱེས་པ་དང་།
en: It is unborn in the prior limit,

source: ཕྱི་མའི་མཐར་མི་འཕོ་བ་དང་།
en: not transferred at the later limit, and

source: དབུས་སུ་བདེན་པ་ཡིན་ནོ། །
en: isolated in the middle.

source: དེ་ལྟར་དེ་དག་ཇི་ལྟ་བ་བཞིན་གྱི་གནས་ཡིན་ཏེ།
en: In this way, for all those things there is a ‘consistent basis.’

source: གཅིག་ཇི་ལྟ་བ་བཞིན་དུ་ཐམས་ཅད་དེ་བཞིན་ལ།
en: Just as one is, so are all;

source: ཐམས་ཅད་ཇི་ལྟ་བ་བཞིན་དུ་གཅིག་ཀྱང་དེ་བཞིན་ཏེ།
en: just as all are, so is one.

source: འཇམ་དཔལ་འདི་ལ་ནི་གཅིག་པ་ཉིད་དམ། མང་པོ་ཉིད་དུ་དམིགས་སུ་མེད་དོ། །
en: And in this respect, Mañjuśrī, neither oneness nor plurality is perceived.

source: འཇམ་དཔལ་བྱང་ཆུབ་ནི་རྣམ་པའི་འཇུག་པས་རྣམ་པ་མེད་པར་ཞུགས་པ་ཡིན་ཏེ།
en: “Awakening, Mañjuśrī, enters the aspect-less by entering an aspect.

source: འཇམ་དཔལ་དེ་ལ་རྣམ་པ་ནི་གང་། རྣམ་པ་མེད་པ་ནི་གང་ཞེ་ན།
en: In that respect, Mañjuśrī, what is an aspect, and what is the aspect-less?

source: འཇམ་དཔལ་རྣམ་པ་ཞེས་བྱ་བ་ནི་དགེ་བའི་ཆོས་ཐམས་ཅད་ལ་རྩོམ་པའོ།
en: The aspect, Mañjuśrī, is explained as taking up all wholesome dharmas.

source: རྣམ་པ་མེད་པ་ཞེས་བྱ་བ་ནི་ཆོས་ཐམས་ཅད་དམིགས་སུ་མེད་པའོ། །
en: The aspect-less is explained as the non-perception of any dharmas.

source: རྣམ་པ་ཞེས་བྱ་བ་ནི་སེམས་མི་གནས་པའི་གནས་སྐབས་སོ། །
en: The aspect is explained as the stabilization of an unstable mind.

source: རྣམ་པ་མེད་པ་ཞེས་བྱ་བ་ནི་རྣམ་པར་ཐར་པའི་སྒོ་མཚན་མ་མེད་པའི་ཏིང་ངེ་འཛིན་ཏོ། །
en: The aspect-less is explained as the gate to liberation of the samādhi of no-sign.

source: རྣམ་པ་མེད་པ་ཞེས་བྱ་བ་ནི་རྣམ་པར་ཐར་པའི་སྒོ་མཚན་མ་མེད་པའི་ཏིང་ངེ་འཛིན་ཏོ།
en: The aspect-less is explained as the gate to liberation of the samādhi of no-sign.

source: རྣམ་པ་ཞེས་བྱ་བ་ནི་ཆོས་ཐམས་ཅད་ལ་སེམས་པ་དང་འཇལ་བ་དང་། བགྲང་བ་དང་། སོ་སོར་རྟོག་པའོ། །
en: The aspect is explained as thinking, comparing, counting, and thorough consideration of all dharmas.

source: རྣམ་པ་མེད་པ་ཞེས་བྱ་བ་ནི་གཞལ་བ་ལས་ཡང་དག་པར་འདས་པ་སྟེ
en: The aspect-less is explained as transcending comparison.

source: གཞལ་བ་ལས་ཡང་དག་པར་འདས་པ་ཡང་གང་ཞེ་ན།
en: What is transcending comparison?

source: གང་ལ་རྣམ་པར་ཤེས་པའི་ལས་མེད་པའོ། །
en: It is that with respect to which there is no function of consciousness.

source: རྣམ་པ་ཞེས་བྱ་བ་ནི་འདུས་བྱས་ལ་སོ་སོར་རྟོག་པའོ། །
en: The aspect is explained as the thorough consideration of the co-produced.

source: རྣམ་པ་མེད་པ་ཞེས་བྱ་བ་ནི་འདུས་མ་བྱས་ལ་སོ་སོར་རྟོག་པའོ། །
en: The aspect-less is explained as the thorough consideration of the unproduced.

source: འཇམ་དཔལ་བྱང་ཆུབ་ནི་ཟག་པ་མེད་པ་ཉིད་དང་། ལེན་པ་མེད་པ་ཉིད་ཡིན་ཏེ།
en: “Awakening, Mañjuśrī, is without outflows and without clinging.

source: འཇམ་དཔལ་དེ་ལ་ཟག་པ་མེད་པ་གང་ལེན་པ་མེད་པ་ཉིད་གང་ཞེ་ན།
en: In that respect, Mañjuśrī, how is it without outflows, and how is it without clinging?

source: འཇམ་དཔལ་ཟག་པ་མེད་པ་ཉིད་ཅེས་བྱ་བ་ནི་ཟག་པ་བཞི་དང་བྲལ་བ་སྟེ།
en: Being without outflows, Mañjuśrī, is explained as the absence of the four outflows.

source: བཞི་པོ་དེ་དག་ཀྱང་གང་ཞེ་ན།
en: Which four?

source: འདི་ལྟ་སྟེ་འདོད་པའི་ཟག་པ་དང་
en: They are: the outflow of desire,

source: སྲིད་པའི་ཟག་པ་དང་།
en: the outflow of existence,

source: མ་རིག་པའི་ཟག་པ་དང་། །
en: the outflow of ignorance, and

source: ལྟ་བའི་ཟག་པ་སྟེ།
en: the outflow of views.

source: ལེན་པ་མེད་པ་ཉིད་ཅེས་བྱ་བ་ནི་ལེན་པ་བཞི་དང་བྲལ་བ་སྟེ།
en: “Being without clinging is explained as the absence of four types of clinging.

source: འདི་ལྟ་སྟེ་འདོད་པའི་ལེན་པ་དང་།
en: They are: clinging to desire,

source: ལྟ་བའི་ལེན་པ་དང་།
en: clinging to views,

source: ཚུལ་ཁྲིམས་དང་། བརྟུལ་ཞུགས་མཆོག་ཏུ་འཛིན་པའི་ལེན་པ་དང་། །
en: clinging to one’s attachment to discipline and vows, and

source: བདག་ཏུ་སྨྲ་བའི་ལེན་པ་སྟེ།
en: clinging to positing a self.

source: འཇམ་དཔལ་དེ་ལ་སེམས་ཅན་མ་རིག་པས་ལྡོངས་པར་བྱས་པ།
en: “Beings are blinded by ignorance.

source: སྲེད་པས་དཀྲུགས་པར་གྱུར་པ་དག་ནི་
en: Craving disturbs them.

source: ཕན་ཚུན་མངོན་པར་ཞེན་པར་གྱུར་ནས་ལེན་པར་བྱེད་ཀྱི་
en: They develop mutual attachment and cling to each other.

source: དེ་བཞིན་གཤེགས་པས་ནི་བདག་ཏུ་སྨྲ་བའི་ལེན་པ་རྩ་བ་ཡིན་པར་ཡོངས་སུ་ཤེས་ནས།
en: In that respect, Mañjuśrī, the Tathāgata thoroughly understands that the root of clinging is the position of a self.

source: བདག་རྣམ་པར་དག་པས་སེམས་ཅན་ཐམས་ཅད་རྣམ་པར་དག་པ་རྗེས་སུ་རྟོགས་པར་གྱུར་ཏེ།
en: Through self-purity, he understands the purity of all sentient beings.

source: བདག་རྣམ་པར་དག་པ་གང་ཡིན་པ་དང་། སེམས་ཅན་ཐམས་ཅད་རྣམ་པར་དག་པ་གང་ཡིན་པ་དེ་ནི་གཉིས་སུ་མེད་དེ་གཉིས་སུ་དབྱེར་མེད་ལ།
en: The purity of self is the purity of all sentient beings. The purity of all sentient beings is non-dual, not divided into two.

source: གཉིས་སུ་མེད་པའི་དོན་གང་ཡིན་པ་དེ་ནི་སྐྱེ་བ་མེད་པ་དང་། འགག་པ་མེད་པ་ཡིན་ནོ། །
en: And the meaning of non-duality is non-arising and non-cessation.

source: འཇམ་དཔལ་སྐྱེ་བ་མེད་པ་དང་། འགག་པ་མེད་པ་ལ་ནི་སེམས་དང་ཡིད་དང་། རྣམ་པར་ཤེས་པ་འཇུག་པར་མི་འགྱུར་ཏེ།
en: “With respect to non-arising and non-cessation, Mañjuśrī, mind, mentality, and consciousness do not come about.

source: དེ་ལ་ནི་ཡོངས་སུ་རྟོགས་པ་གང་གིས་ཚུལ་བཞིན་མ་ཡིན་པ་ཡིད་ལ་བྱེད་པར་འགྱུར་བའི་ཡོངས་སུ་རྟོག་པ་གང་ཡང་མེད་དོ།
en: In that respect there is no mental construct by which one may place the mind improperly.

source: དེ་ལ་ནི་ཡོངས་སུ་རྟོགས་པ་གང་གིས་ཚུལ་བཞིན་མ་ཡིན་པ་ཡིད་ལ་བྱེད་པར་འགྱུར་བའི་ཡོངས་སུ་རྟོག་པ་གང་ཡང་མེད་དོ། །
en: In that respect there is no mental construct by which one may place the mind improperly.

source: ཚུལ་བཞིན་ཡིད་ལ་བྱེད་པ་ལ་རབ་ཏུ་བརྩོན་པ་དེ་ནི་མ་རིག་པ་ཀུན་ནས་སློང་བ་མི་བྱེད་དོ། །
en: Whosoever engages in proper mental placement does not give rise to ignorance.

source: མ་རིག་པ་ཀུན་ནས་ལྡང་བ་མེད་པ་གང་ཡིན་པ་དེ་ནི་སྲིད་པའི་ཡན་ལག་བཅུ་གཉིས་པོ་དག་གི་ཀུན་ནས་སློང་བ་མེད་པ་ཡིན་ནོ། །
en: Not giving rise to ignorance means not giving rise to the twelve limbs of existence.

source: སྲིད་པའི་ཡན་ལག་བཅུ་གཉིས་པོ་དག་གི་ཀུན་ནས་ལྡང་བ་མེད་པ་གང་ཡིན་པ་དེ་ནི་སྐྱེ་བ་མེད་པ་ཡིན་ནོ། །
en: Not giving rise to the twelve limbs of existence means no birth.

source: སྐྱེ་བ་མེད་པ་གང་ཡིན་པ་དེ་ནི་སྐྱོན་མེད་པ་ཡིན་ནོ། །
en: No birth is the fixed rule.

source: སྐྱོན་མེད་པ་གང་ཡིན་པ་དེ་ནི་ངེས་པའི་དོན་ཡིན་ནོ
en: The fixed rule is the definitive meaning.

source: ངེས་པའི་དོན་གང་ཡིན་པ་དེ་ནི་དོན་དམ་པ་ཡིན་ནོ། །
en: The definitive meaning is the ultimate meaning.

source: དོན་དམ་པ་གང་ཡིན་པ་དེ་ནི་གང་ཟག་མེད་པའི་དོན་ཡིན་ནོ། །
en: The ultimate meaning means to be devoid of a person.

source: གང་ཟག་མེད་པའི་དོན་གང་ཡིན་པ་དེ་ནི་བརྗོད་དུ་མེད་པའི་དོན་ཡིན་ནོ། །
en: The meaning of being devoid of a person is the ineffable meaning.

source: བརྗོད་དུ་མེད་པའི་དོན་གང་ཡིན་པ་དེ་ནི་རྟེན་ཅིང་འབྲེལ་པར་འབྱུང་བའི་དོན་ཡིན་ནོ། །
en: The ineffable meaning is the meaning of dependent arising.

source: རྟེན་ཅིང་འབྲེལ་པར་འབྱུང་བའི་དོན་གང་ཡིན་པ་དེ་ནི་ཆོས་ཀྱི་དོན་ཡིན་ནོ། །
en: The meaning of dependent arising is the meaning of the Dharma.

source: ཆོས་ཀྱི་དོན་གང་ཡིན་པ་དེ་ནི་དེ་བཞིན་གཤེགས་པའི་དོན་ཡིན་ཏེ།
en: The meaning of the Dharma is the meaning of the Tathāgata.

source: དེའི་ཕྱིར་གང་གིས་རྟེན་ཅིང་འབྲེལ་པར་འབྱུང་བ་མཐོང་བ་དེས་ཆོས་མཐོང་ངོ་། །
en: Hence it is said, ‘One who sees dependent arising sees the Dharma;

source: གང་གིས་ཆོས་མཐོང་བ་དེས་དེ་བཞིན་གཤེགས་པ་མཐོང་ངོ་ཞེས་གསུངས་ཏེ།
en: one who sees the Dharma sees the Tathāgata.’

source: ཇི་ལྟར་ཡོངས་སུ་ཚོལ་བ་ན་ཅི་ཡང་མི་མཐོང་བ་དེ་ལྟར་མཐོང་ངོ་། །འཇམ་དཔལ་དེ་ལ་ཅི་ཡང་ཞེས་བྱ་བ་གང་ཞེ་ན། འདི་ལྟ་སྟེ་སེམས་དང་དམིགས་པ་སྟེ། །
en: And he sees in such a way that, when he searches, he does not see anything whatsoever.

source: དེས་གང་གི་ཚེ་སེམས་དང་དམིགས་པ་ཡང་དག་པར་རྗེས་སུ་མི་མཐོང་བ་དེའི་ཚེ་ན་ཡང་དག་པར་མཐོང་བ་ཡིན་པས། །
en: When one does not see the mind and the point of reference, one then sees reality.
